Autodesk.Revit.DB.UnitUtils.GetUnitGroup(Autodesk.Revit.DB.ForgeTypeId)
Gets the unit group for a given measurable spec.
specTypeId:
Identifier of the measurable spec.
Returns:
The unit group.
Throws Autodesk.Revit.Exceptions.ArgumentException:
specTypeId is not a measurable spec identifier. See UnitUtils.IsMeasurableSpec(ForgeTypeId).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.UnitUtils.GetAllSpecs
Gets the identifiers of all available measurable specs.
Returns:
The measurable spec identifiers.
Since:
2014

Autodesk.Revit.DB.UnitUtils.IsSpec(Autodesk.Revit.DB.ForgeTypeId)
Checks whether a ForgeTypeId identifies a spec associated with units of measurement.
specTypeId:
The identifier to check.
Returns:
True if the ForgeTypeId identifies a measurable spec, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014